Notebook - análise exploratória de dados

Gabriela Caesar

23/set/2021

Verificação do dataframe

In [39]:
# importacao da biblioteca
import pandas as pd

In [40]:
# leitura do dataframe
lgbt_casamento = pd.read_csv('https://raw.githubusercontent.com/gabrielacaesar/lgbt_casamento/main/data/lgbt_casamento.csv')

In [41]:
# primeiras linhas do nosso dataframe
lgbt_casamento.head()

    ano        uf     genero        mes  numero
0  2014  Rondônia  Masculino    Janeiro       0
1  2014  Rondônia  Masculino  Fevereiro       0
2  2014  Rondônia  Masculino      Março       0
3  2014  Rondônia  Masculino      Abril       0
4  2014  Rondônia  Masculino       Maio       0

In [42]:
# últimas linhas do nosso dataframe
lgbt_casamento.tail()

       ano                uf    genero       mes  numero
4531  2019  Distrito Federal  Feminino    Agosto       7
4532  2019  Distrito Federal  Feminino  Setembro       9
4533  2019  Distrito Federal  Feminino   Outubro      13
4534  2019  Distrito Federal  Feminino  Novembro      11
4535  2019  Distrito Federal  Feminino  Dezembro       7

In [43]:
# infos sobre o dataframe
lgbt_casamento.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4536 entries, 0 to 4535
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ano     4536 non-null   int64
 1   uf      4536 non-null   object
 2   genero  4536 non-null   object
 3   mes     4536 non-null   object
 4   numero  4536 non-null   int64
dtypes: int64(2), object(3)
memory usage: 177.3+ KB

In [44]:
# estatisticas das colunas numericas do dataframe
lgbt_casamento.describe()

              ano       numero
count  4536.00000  4536.000000
mean   2016.00000     9.693783
std       2.00022    25.962171
min    2013.00000     0.000000
25%    2014.00000     1.000000
50%    2016.00000     3.000000
75%    2018.00000     9.000000
max    2019.00000   827.000000

In [45]:
# cabeçalho da dataframe
lgbt_casamento.columns

Index(['ano', 'uf', 'genero', 'mes', 'numero'], dtype='object')

In [46]:
# valores únicos da coluna 'ano' do dataframe
lgbt_casamento['ano'].unique()

array([2014, 2013, 2015, 2016, 2017, 2018, 2019])

In [47]:
# valores únicos da coluna 'mes' do dataframe
lgbt_casamento['mes'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [48]:
# valores únicos da coluna 'genero' do dataframe
lgbt_casamento['genero'].unique()

array(['Masculino', 'Feminino'], dtype=object)

In [49]:
# valores únicos da coluna 'uf' do dataframe
lgbt_casamento['uf'].unique()

array(['Rondônia', 'Acre', 'Amazonas', 'Roraima', 'Pará', 'Amapá',
       'Tocantins', 'Maranhão', 'Piauí', 'Ceará', 'Rio Grande do Norte',
       'Paraíba', 'Pernambuco', 'Alagoas', 'Sergipe', 'Bahia',
       'Minas Gerais', 'Espírito Santo', 'Rio de Janeiro', 'São Paulo',
       'Paraná', 'Santa Catarina', 'Rio Grande do Sul',
       'Mato Grosso do Sul', 'Mato Grosso', 'Goiás', 'Distrito Federal'],
      dtype=object)

In [50]:
# tamanho dos valores únicos da coluna 'uf' do dataframe
len(lgbt_casamento['uf'].unique())

27

In [51]:
# tamanho dos valores únicos da coluna 'mes' do dataframe
len(lgbt_casamento['mes'].unique())

12

In [52]:
# tamanho dos valores únicos da coluna 'ano do dataframe
len(lgbt_casamento['ano'].unique())

7

In [53]:
# seleciona apenas a coluna 'ano'
# observe que mostra o tamanho de 9.072 linhas
lgbt_casamento['mes']

0         Janeiro
1       Fevereiro
2           Março
3           Abril
4            Maio
          ...
4531       Agosto
4532     Setembro
4533      Outubro
4534     Novembro
4535     Dezembro
Name: mes, Length: 4536, dtype: object

In [54]:
# número de linhas na coluna 'numero'
len(lgbt_casamento['mes'])

4536

In [55]:
# pergunta se aquele campo da coluna 'mes' é NA (ou seja, sem preenchimento)
lgbt_casamento['mes'].isna()

0       False
1       False
2       False
3       False
4       False
        ...
4531    False
4532    False
4533    False
4534    False
4535    False
Name: mes, Length: 4536, dtype: bool

In [56]:
# pergunta se aquele campo da coluna 'numero' é NA (ou seja, sem preenchimento)
lgbt_casamento['numero'].isna()

0       False
1       False
2       False
3       False
4       False
        ...
4531    False
4532    False
4533    False
4534    False
4535    False
Name: numero, Length: 4536, dtype: bool

In [57]:
# número máximo da coluna 'numero'
lgbt_casamento['numero'].max()

827

In [58]:
# número mínimo da coluna 'numero'
lgbt_casamento['numero'].min()

0

In [59]:
# média da coluna 'numero'
lgbt_casamento['numero'].mean()

9.693783068783068

In [60]:
# mediana da coluna 'numero'
lgbt_casamento['numero'].median()

3.0

In [61]:
# soma da coluna 'numero'
sum(lgbt_casamento['numero'])

43971